-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:8889
-- Час створення: Лют 20 2023 р., 22:32
-- Версія сервера: 5.7.34
-- Версія PHP: 8.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `bSreda`
--

-- --------------------------------------------------------

--
-- Структура таблиці `events`
--

CREATE TABLE `events` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `descr` varchar(255) NOT NULL,
  `place` varchar(255) NOT NULL,
  `date` datetime NOT NULL,
  `category` int(11) NOT NULL COMMENT '1-meeting\r\n\r\n2-QA\r\n3-Conference\r\n4-webinar'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп даних таблиці `events`
--

INSERT INTO `events` (`id`, `name`, `descr`, `place`, `date`, `category`) VALUES
(9, 'asdsa11', 'asdasdds1', 'asdasd1', '2022-08-10 02:04:00', 3),
(12, 'New event', 'escr', 'Location', '2022-08-04 03:05:00', 1),
(13, 'Meeting', 'Webinar', 'sassdas', '2022-08-04 01:01:00', 4),
(14, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 4),
(15, 'sadasd', 'asdasda', 'dasdas', '2022-08-05 02:05:00', 3),
(17, 'asdsa44', 'asdasdds44', 'asdasd44', '2022-08-03 02:44:00', 2),
(18, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 4),
(20, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(21, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(22, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(23, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(24, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(25, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(26, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(27, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(28, 'sddfasda', 'asdasd', 'asdasdas', '2022-08-04 03:04:00', 1),
(29, 'sddfasda1111', 'asdasd111', 'asdasdas', '2022-08-04 03:04:00', 1),
(30, 'Todays234', 'Todays descript23', 'Locat23', '2022-08-01 02:03:00', 1),
(31, 'asdssda', 'asdasdasdasd', 'asdasdasd', '2022-08-06 03:05:00', 3),
(33, '123', '123', '123', '2022-08-09 00:00:00', 2),
(35, 'asad', 'asdasdas', 'asdas', '2022-07-20 00:00:00', 1),
(36, '3123', '123123', '123123', '2022-07-06 00:00:00', 1),
(37, 'asdasd', 'asdasd', 'asdasdas', '2022-08-05 00:00:00', 1),
(38, 'sadasdas', 'asdasda', 'sadasdas', '2022-08-03 00:00:00', 3),
(44, 'qwe111', 'qwe', 'qwe', '2022-08-02 03:03:00', 2),
(45, 'qwe111', 'qwe', 'qwe', '2022-08-02 03:03:00', 2),
(46, 'qwe111', 'qwe', 'qwe', '2022-08-02 03:03:00', 2),
(47, 'qwe111', 'qwe', 'qwe', '2022-08-02 03:03:00', 2),
(48, 'qwe111', 'qwe', 'qwe', '2022-08-02 03:03:00', 2),
(49, 'qwe111', 'qwe', 'qwe', '2022-08-02 03:03:00', 2),
(50, 'qwe111', 'qwe', 'qwe', '2022-08-02 03:03:00', 2),
(51, 'ads', 'sad', 'asd', '2022-08-11 00:03:00', 1),
(52, 'sad', 'as', 'aads', '2022-08-12 04:05:00', 1),
(53, 'qwe', 'qewq', 'asd', '2022-08-12 03:04:00', 1),
(54, 'qwe', 'qwe', 'qwe', '2022-08-12 03:04:00', 3),
(55, 'asdas', 'sadsa', 'asd', '2022-08-12 02:04:00', 3),
(56, '123', '123', '123', '2022-08-11 02:04:00', 3),
(57, '123', '123', '123', '2022-08-13 02:04:00', 1),
(58, 'asda', 'asdas', 'asdas', '2022-08-19 03:03:00', 3),
(59, 'asd', 'asd', 'asd', '2022-08-17 02:01:00', 3),
(60, 'asdsa', 'asdasd', 'asdas', '2022-08-19 03:03:00', 1),
(61, 'asd', 'asd', 'asdas', '2022-08-16 03:04:00', 3),
(62, 'asda', 'asdas', 'asdasd', '2022-08-09 00:00:00', 2),
(63, '123', '21312', '12312', '2022-08-14 20:00:00', 1),
(64, 'qwew', 'wqeqw', 'qweqw', '2022-08-14 20:00:00', 1),
(65, 'qweqw', 'wqeqw', 'wqe', '2022-08-14 20:00:00', 1),
(66, 'qweqw', 'wqeqw', 'wqe', '2022-08-14 20:00:00', 1),
(67, 'qwewq', 'wqeqw', 'qwewq', '2022-08-21 20:00:00', 1),
(68, 'asdas', 'asdas', 'asdas', '2022-08-22 20:00:00', 1),
(69, 'wqeqw', 'qweqw', 'qweqw', '2022-08-14 20:00:00', 2),
(70, 'wqeq', 'qweq', 'qweqw', '2022-08-14 20:00:00', 3),
(71, 'qwe', 'qwe', 'weq', '2022-08-21 20:00:00', 2),
(72, 'adsd', 'sada', 'asd', '2022-08-22 20:00:00', 1),
(73, 'sdfas', 'asdas', 'asd', '2022-08-27 20:00:00', 1),
(74, 'asd', 'asd', 'asd', '2022-08-27 20:00:00', 2),
(75, 'asda', 'asdasd', 'asdasd', '2022-08-27 20:00:00', 2),
(76, 'asds', 'asd', 'asd', '2022-08-20 20:00:00', 1),
(77, 'asdas', 'asdas', 'adas', '2022-08-27 20:00:00', 3),
(78, '12312', '12312', '1231', '2022-08-31 20:00:00', 2),
(79, '123', '123', '123', '2022-08-23 20:00:00', 1),
(80, '123', '123', '123', '2022-08-23 20:00:00', 2),
(81, 'zxc', 'zxc', 'zxc', '2022-08-24 20:00:00', 1),
(82, 'zxc', 'zxc', 'zxc', '2022-08-25 20:00:00', 1),
(83, 'asd', 'asd', 'asd', '2022-08-08 20:00:00', 1),
(84, '123', '123', '123', '2022-08-30 20:00:00', 1),
(85, 'qwe', 'qw', 'qwe', '2022-08-30 20:00:00', 2),
(86, '234', '234', '234', '2022-08-30 20:00:00', 1),
(87, '123', '123', '123', '2022-08-29 20:00:00', 1),
(88, '234', '234', '234', '2022-08-29 20:00:00', 2),
(89, '132', '123', '123', '2022-08-13 20:00:00', 1),
(90, '234', '234', '234', '2022-08-13 20:00:00', 1),
(91, 'qwe', 'qwe', 'wqe', '2022-08-13 20:00:00', 4),
(92, '123!!!', '123!', '12', '2022-08-31 20:00:00', 2),
(93, 'ZXC', 'ZXC', 'ZXC', '2022-08-31 20:00:00', 4),
(94, 'ZXC', 'ZXC', 'ZXC', '2022-08-01 20:00:00', 1),
(95, 'ZXC', 'ZXC', 'ZXC', '2022-08-01 20:00:00', 1),
(96, 'XZC', 'ZXC', 'ZXC', '2022-08-01 20:00:00', 1),
(97, 'QEW', 'QWE', 'QWE', '2022-08-01 20:00:00', 1),
(98, 'qwe', 'qwe', 'qwe', '2022-08-31 20:00:00', 1),
(99, 'asd', 'asd', 'asd', '2022-08-31 20:00:00', 1),
(100, 'ads', 'asd', 'asd', '2022-08-19 20:00:00', 1),
(101, 'asd', 'sad', 'asd', '2022-08-23 20:00:00', 1),
(102, 'sda', 'asd', 'asd', '2022-08-31 20:00:00', 1),
(103, 'wqe', 'qwe', 'qwe', '2022-08-31 20:00:00', 1),
(105, 'wqe', 'qwe', 'qweqw', '2022-08-28 20:00:00', 1),
(106, 'qweq', 'qwe', 'qe', '2022-08-28 20:00:00', 1),
(107, 'eqwe', 'qwew', 'qwe', '2022-08-29 20:00:00', 1),
(108, 'eqweqw', 'qweqwe', 'qweqw', '2022-08-07 20:00:00', 1),
(109, 'qweqwe', 'qweqwe', 'qweqw', '2022-08-07 20:00:00', 1),
(110, 'qwewqe', 'qweqwe', 'qweqw', '2022-08-07 20:00:00', 2),
(111, 'asdad', 'sadas', 'asdasd', '2022-08-07 20:00:00', 1),
(112, 'asdas', 'asdas', 'asd', '2022-08-08 20:00:00', 1),
(113, 'asdsa', 'asd', 'asd', '2022-08-23 20:00:00', 1),
(114, 'asdasd', 'asdsa', 'asd', '2022-08-10 20:00:00', 1),
(116, 'asdasd', 'asdasd', 'asd', '2022-08-25 20:00:00', 1),
(117, 'asdas', 'asdasd', 'asd', '2022-08-25 20:00:00', 1),
(118, 'asdas', 'asdas', 'asda', '2022-08-17 20:00:00', 1),
(119, 'aasdsa', 'axzc', 'asds', '2022-08-17 20:00:00', 1),
(120, 'sad', 'asd', 'sad', '2022-08-09 20:00:00', 1),
(121, 'zzx', 'xxx', 'xx', '2022-08-09 20:00:00', 1),
(122, '', '', '', '2022-08-01 20:00:00', 1),
(124, '123', '123', '123', '2022-08-15 20:00:00', 1),
(125, '234', '234', '234', '2022-08-15 20:00:00', 1),
(126, 'wqeqw', 'ewqeqwe', 'qweqwe', '2022-08-01 20:00:00', 1),
(127, 'sdfd', 'sdfs', 'sdfsd', '2022-08-10 20:00:00', 2),
(128, 'wqeqwe!!!!', 'wqeqwe', 'eaweawd', '2022-08-28 00:02:00', 4);

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `events`
--
ALTER TABLE `events`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `events`
--
ALTER TABLE `events`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=129;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
